Revit 2027 API
BuiltInFailures.PartMakerMethodForWallFailures.CouldNotCreateWallPart Property
 Failed to create basic layer geometry. Probably a failure either to create the cutter or to intersect the cutter with the wall geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouldNotCreateWallPart { get; }
Public Shared ReadOnly Property CouldNotCreateWallPart As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouldNotCreateWallPart {
	FailureDefinitionId^ get ();
}
static member CouldNotCreateWallPart : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PartMakerMethodForWallFailures Class
Autodesk.Revit.DB Namespace